In [2]:
# Data Procssing - Cleaning & Transformation"
import pandas as pd

### Read File

In [3]:
#read csv file
df = pd.read_csv('data.csv', delimiter = ',')
df.head()

  name  score
0    A     10
1    B     20
2    C     30

In [4]:
#read json file
df = pd.read_json('data3.json')
df.head()

        date name       days  label
0 2021-01-01  abc     monday  AA101
1 2021-01-01  abc    tuesday  AA101
2 2021-01-01  abc  wednesday  AA101
3 2021-01-01  abc   thursday  AA101

### Save dataframe to csv

In [5]:
data = {'col1': ['a', 'b', 'c'], 'col2': [1, 2, 3]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a     1
1    b     2
2    c     3

In [6]:
df.to_csv('result.csv', index = False)

### Filter Data

In [7]:
data = {'col1': ['a', 'b', 'c','d'], 'col2': [20, 10, 40, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    20
1    b    10
2    c    40
3    d    30

In [8]:
df[(df['col2']>=15) & (df['col2']<=35)].head()

  col1  col2
0    a    20
3    d    30

In [9]:
df[(df['col2']==10) | (df['col2']==40)].head()

  col1  col2
1    b    10
2    c    40

In [10]:
df[df['col2'].isin([20,40])].head()

  col1  col2
0    a    20
2    c    40

### Rename column

In [11]:
data = {'col1': ['a', 'b', 'c','d'], 'col2': [20, 10, 40, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    20
1    b    10
2    c    40
3    d    30

In [12]:
df.rename(columns = {'col1':'name'}, inplace = True)
df.head()

  name  col2
0    a    20
1    b    10
2    c    40
3    d    30

### Drop column

In [13]:
data = {'col1': ['a', 'b', 'c','d'], 'col2': [20, 10, 40, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    20
1    b    10
2    c    40
3    d    30

In [14]:
df.drop(columns = ['col1'], inplace = True)
df.head()

   col2
0    20
1    10
2    40
3    30

### Group BY

In [15]:
data = {'col1': ['a', 'b', 'c','a','b'], 'col2': [10, 20, 20, 10, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    10
1    b    20
2    c    20
3    a    10
4    b    30

In [16]:
df = df.groupby(['col1']).agg(col2_sum = ('col2','sum')).reset_index()
df.head()

  col1  col2_sum
0    a        20
1    b        50
2    c        20

### Sort Values

In [17]:
data = {'col1': ['a', 'b', 'c','d'], 'col2': [20, 10, 40, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    20
1    b    10
2    c    40
3    d    30

In [18]:
df = df.sort_values(['col2'], ascending = [False])
df.head()

  col1  col2
2    c    40
3    d    30
0    a    20
1    b    10

### Join tables

In [19]:
data = {'col1': ['a', 'b', 'c'], 'col2': [1, 2, 3]}
df1 = pd.DataFrame(data)
df1.head()

  col1  col2
0    a     1
1    b     2
2    c     3

In [20]:
data = {'col1': ['b', 'c', 'd'], 'col3': [20, 30, 40]}
df2 = pd.DataFrame(data)
df2.head()

  col1  col3
0    b    20
1    c    30
2    d    40

In [21]:
df3 = pd.merge(df1, df2, on = ['col1'], how = 'outer')
df3.head()

  col1  col2  col3
0    a   1.0   NaN
1    b   2.0  20.0
2    c   3.0  30.0
3    d   NaN  40.0

### Concat tables

In [22]:
data = {'col1': ['a', 'b', 'c'], 'col2': [1, 2, 3]}
df1 = pd.DataFrame(data)
df1.head()

  col1  col2
0    a     1
1    b     2
2    c     3

In [23]:
data = {'col1': ['d', 'e'], 'col2': [4,5]}
df2 = pd.DataFrame(data)
df2.head()

  col1  col2
0    d     4
1    e     5

In [24]:
df3 = pd.concat([df1, df2], ignore_index = True)
df3.head()

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5

### Calculated Column

In [25]:
data = {'col1': ['a', 'b', 'c'], 'col2': [10, 20, 30]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    10
1    b    20
2    c    30

In [26]:
df['col3'] = df['col2'].apply(lambda x:x**3)
df.head()

  col1  col2   col3
0    a    10   1000
1    b    20   8000
2    c    30  27000

### Drop Duplicate

In [27]:
data = {'col1': ['a', 'b', 'c','a'], 'col2': [10, 20, 20, 10]}
df = pd.DataFrame(data)
df.head()

  col1  col2
0    a    10
1    b    20
2    c    20
3    a    10

In [28]:
df = df.drop_duplicates().reset_index(drop=True)
df.head()

  col1  col2
0    a    10
1    b    20
2    c    20

### Drop None

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

In [29]:
data = {'col1': [' a', 'b ', 'c', None, None], 'col2': [1, 2, None, 3, None]}
df = pd.DataFrame(data)
df.dropna(inplace=True)
df.head()

  col1  col2
0    a   1.0
1   b    2.0

In [30]:
data = {'col1': [' a', 'b ', 'c', None], 'col2': [1, 2, None, 3]}
df = pd.DataFrame(data)
df.dropna(inplace=True, how = 'all')
df.head()

   col1  col2
0     a   1.0
1    b    2.0
2     c   NaN
3  None   3.0

In [31]:
data = {'col1': [' a', 'b ', 'c', None], 'col2': [1, 2, None, 3]}
df = pd.DataFrame(data)
df.dropna(inplace=True, how = 'any')
df.head()

  col1  col2
0    a   1.0
1   b    2.0

In [32]:
data = {'col1': [' a', 'b ', 'c', None], 'col2': [1, 2, None, 3]}
df = pd.DataFrame(data)
df.dropna(subset = ['col1'], inplace=True) #remove row having any null value in specified column
df.head()

  col1  col2
0    a   1.0
1   b    2.0
2    c   NaN

In [33]:
data = {'col1': [' a', 'b ', 'c', 'd'], 'col2': [1, 2, None, 3], 'col3': [1, 2, None, 3]}
df = pd.DataFrame(data)
df.dropna(inplace=True, axis = 1) #remove column having null value
df.head()

  col1
0    a
1   b
2    c
3    d